"""
    Витушкин Денис
    Создайте кортежи из пар элементов списков и запишите их в список results. 
"""
l1 = ['a', 'b', 'c', 'd', 'e']
l2 = [1, 2, 3, 4, 5, 6, 7, 8]

res = list(map(lambda x, y: (x, y), l1, l2))
print(res)