"""
    Витушкин Денис.
    Напишите программу, запрашивающую у пользователя число и подсчитывающую сумму 
    натуральных положительных чисел от 1 до введенного пользователем значения
"""

n = int(input("Enter n: "))
print("Sum = ", n * ( n + 1 ) / 2)
