"""
    Витушкин Денис
    Дано слово объектно-ориентированный. Используя индексацию и срезы составьте из него слова объект, ориентир, тир, кот, рента и выведите их на экран.
"""

string = "объектно-ориентированный"
print(string[0:6])
print(string[9:17])
print(string[14:17])
print(string[4] + string[7] + string[14])
print(string[10] + string[12:15] + string[19])